HomeWork103forEDT/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

HomeWork103forEDT/src/Documents/ПоступлениеТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииКоличества(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока);
	
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Количество * ИзмененнаяСтрока.Цена;
	ПриИзмененииСуммы(ИзмененнаяСтрока);

КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииЦены(ИзмененнаяСтрока);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока);
	
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Количество * ИзмененнаяСтрока.Цена;
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока);
	
	Если ИзмененнаяСтрока.Количество = 0 Тогда
		Возврат;
	Иначе
		ИзмененнаяСтрока.Цена = ИзмененнаяСтрока.Сумма / ИзмененнаяСтрока.Количество;	
	КонецЕсли;
	
	Сумма = ИзмененнаяСтрока.Сумма;
	СтавкаНДС = ИзмененнаяСтрока.СтавкаНДС;
	СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(Сумма,СтавкаНДС);
	ИзмененнаяСтрока.СуммаНДС = СуммаНДС;
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.ТоварыИУслуги.ТекущиеДанные;
	ПриИзмененииСтавкиНДС(ИзмененнаяСтрока);
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока);
	
	Сумма = ИзмененнаяСтрока.Сумма;
	СтавкаНДС = ИзмененнаяСтрока.СтавкаНДС;
	СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(Сумма,СтавкаНДС);
	ИзмененнаяСтрока.СуммаНДС = СуммаНДС;
КонецПроцедуры
